УчетВУправляющихДляГит1/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИспользованияРабочегоВремени</name>
  <predefined>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь без оплаты</description>
    </items>
    <items>
      <name>Вахта</name>
      <description>Вахта</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Вынужденный прогул</description>
    </items>
    <items>
      <name>ВыходныеДни</name>
      <description>Выходные дни</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Государственные обязанности</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Дополнительные выходные дни не оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Дополнительные выходные дни оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>Дополнительный отпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забастовка</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержка выплаты заработной платы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КормлениеРебенка</name>
      <description>Кормление ребенка</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>Неоплачиваемый дополнительный отпуск</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>Неоплачиваемый отпуск по законодательству</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>Неоплачиваемый отпуск по разрешению работодателя</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки по невыясненным причинам</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Основной отпуск</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Отпуск на обучение</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Отпуск на обучение неоплачиваемый</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстранение от работы без оплаты</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстранение от работы с оплатой</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Повышение квалификации</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Повышение квалификации в другой местности</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Праздники</description>
    </items>
    <items>
      <name>ПраздникиБезПовышеннойОплаты</name>
      <description>Праздники без повышенной оплаты</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РаботаВРежимеНеполногоВремени</name>
      <description>Работа в режиме неполного времени</description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа вечерние часы</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа ночные часы</description>
    </items>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Сверхурочные</description>
    </items>
    <items>
      <name>СверхурочныеБезПовышеннойОплаты</name>
      <description>Сверхурочные без повышенной оплаты</description>
    </items>
    <items>
      <name>СокращенноеВремяОбучающихся</name>
      <description>Сокращенное время обучающихся</description>
    </items>
    <items>
      <name>СокращенноеРабочееВремя</name>
      <description>Сокращенное рабочее время</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКодБюджетный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКодБюджетный2009</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеВремя</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Целосменное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/ВидыИспользованияРабочегоВремени/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		РежимВыбораИнформацииОВидеВремени = Параметры.РежимВыбораИнформацииОВидеВремени;
		Если РежимВыбораИнформацииОВидеВремени Тогда
			РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		КонецЕсли;
	КонецЕсли;
	
	ВидВремениРабочееВремя = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя");
	
	Если ВидВремениРабочееВремя <> Неопределено Тогда 
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = ВидВремениРабочееВремя;
	КонецЕсли;
	
	УчетРабочегоВремени.ПриСозданииФормыСпискаСправочникаВидыИспользованияРабочегоВремени(ЭтаФорма, Параметры);
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список",,,, "Ссылка, Предопределенный");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не РежимВыбораИнформацииОВидеВремени Тогда
		Возврат;
	КонецЕсли;

	ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
	
	ДанныеВыбора = Новый Структура("ВидВремени, БуквенноеОбозначение, Наименование, Целосменное"); 
	ДанныеВыбора.ВидВремени = ВыбраннаяСтрока;
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		ДанныеВыбора.БуквенноеОбозначение = ДанныеТекущейСтроки.БуквенныйКод;
		ДанныеВыбора.Наименование = ДанныеТекущейСтроки.Наименование;
		ДанныеВыбора.Целосменное = ДанныеТекущейСтроки.Целосменное;
	КонецЕсли;
	
 	ОповеститьОВыборе(ДанныеВыбора);	
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
